nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_i2c.h
/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*! @name Driver version */
/*@{*/
#define FSL_I2C_DRIVER_VERSION (MAKE_VERSION(2, 0, 0))
/*@}*/

#if (defined(FSL_FEATURE_I2C_HAS_START_STOP_DETECT) && FSL_FEATURE_I2C_HAS_START_STOP_DETECT || \
     defined(FSL_FEATURE_I2C_HAS_STOP_DETECT) && FSL_FEATURE_I2C_HAS_STOP_DETECT)
#define I2C_HAS_STOP_DETECT
#endif /* FSL_FEATURE_I2C_HAS_START_STOP_DETECT / FSL_FEATURE_I2C_HAS_STOP_DETECT */

/* ============================================= General Control Macro ============================================== */
/*! @brief Retry times when checking status flags. */
#ifndef I2C_RETRY_TIMES
#define I2C_RETRY_TIMES 0U /* Default defines to zero, driver keeps checking status flag untill it changes. */
#endif

/*! @brief Control whether to use SMBus featues. */
#ifndef I2C_SMBUS_ENABLE
#define I2C_SMBUS_ENABLE 0U /* Default defines to zero, driver uses simple I2C transfer. */
#endif

/*!
 * @brief Control whether to enable FACK for master read operation in non SMBus tranfer. This is used to lower transfer
 * speed by clock stretch for MCU with FSL_FEATURE_I2C_HAS_DOUBLE_BUFFERING supported and enabled.
 */
#ifndef I2C_MASTER_FACK_CONTROL
#define I2C_MASTER_FACK_CONTROL 0U /* Default defines to zero means master will send ack automatically. */
#endif

/* ================================================ Callback Macro ================================================== */
#define I2C_GET_TRANSFER_COMPLETION_STATUS(psHandle) (psHandle)->completionStatus
#define I2C_GET_TRANSFER_USER_DATA(psHandle) (psHandle)->pUserData

#define I2C_GET_SLAVE_TRANSFER_EVENT(psHandle) (psHandle)->sTransfer.eEvent
#define I2C_GET_SLAVE_TRANSFER_DATA_POINTER(psHandle) (psHandle)->sTransfer.pu8Data
#define I2C_GET_SLAVE_TRANSFER_DATASIZE(psHandle) (psHandle)->sTransfer.u16DataSize
#define I2C_GET_SLAVE_TRANSFERRED_COUNT(psHandle) (psHandle)->u16TransferredCount
/* ========================================== End of General Control Macro ========================================== */

/*!
 * @brief I2C API status codes, used by bus operation APIs and transactional APIs as return value to indicate the bus's
 * current status as the API's execution result, or used in the callback to indicate transfer results.
 */
enum
{
    kStatus_I2C_Busy = MAKE_STATUS(kStatusGroup_I2C, 0), /*!< I2C bus is busy. */
    kStatus_I2C_Idle = MAKE_STATUS(kStatusGroup_I2C, 1), /*!< I2C Bus is idle. */
    kStatus_I2C_Nak  = MAKE_STATUS(kStatusGroup_I2C, 2), /*!< I2C detected NACK on bus. When in SMBus mode, this means
                                                            the receiver nacks transmitter before PEC byte. */
    kStatus_I2C_ArbitrationLost = MAKE_STATUS(kStatusGroup_I2C, 3), /*!< I2C lost arbitration during addressing. */
    kStatus_I2C_Timeout =
        MAKE_STATUS(kStatusGroup_I2C, 4), /*!< Timeout happens when waiting for status flags to change. */
    kStatus_I2C_Addr_Nak = MAKE_STATUS(kStatusGroup_I2C, 5), /*!< NACK was detected during the address probe. */
#ifdef I2C_SMBUS_ENABLE
    kStatus_I2C_Pec_Error = MAKE_STATUS(kStatusGroup_I2C, 6), /*!< Detected NACK for the PEC byte in transmit, or the
                                                                 received PEC does not match with the calculated CRC. */
#endif                                                        /* I2C_SMBUS_ENABLE */
};

/* ================================== Functional Group Structure/Enumeration List =================================== */
/* ---------------------------------------- Hardware Status Flags Sub-group ----------------------------------------- */
/*!
 * @brief I2C hardware status flags
 *
 * These enumerations can be ORed together to form bit masks. The masks can be used as parameter by
 * @ref I2C_MasterClearStatusFlags and @ref I2C_SlaveClearStatusFlags, or as return value by
 * @ref I2C_MasterGetStatusFlags and @ref I2C_SlaveGetStatusFlags.
 */
enum _i2c_status_flags
{
    kI2C_ReceiveNakFlag       = I2C_S_RXAK_MASK,
    kI2C_InterruptPendingFlag = I2C_S_IICIF_MASK, /*!< I2C interrupt pending flag. Byte transfer complete, address
                                                     match, arbitration lost, start/stop detection and SMBus timeout can
                                                     all cause this status bit to set. This flag can be cleared. */
    kI2C_SlaveTransmitFlag = I2C_S_SRW_MASK,
    kI2C_RangeAddressMatchInterruptFlag =
        I2C_S_RAM_MASK, /*!< Received address is within address range. This flag can be cleared. */
    kI2C_ArbitrationLostInterruptFlag = I2C_S_ARBL_MASK, /*!< This flag can be cleared. */
    kI2C_BusBusyFlag                  = I2C_S_BUSY_MASK,
    kI2C_AddressAsSlaveInterruptFlag =
        I2C_S_IAAS_MASK, /*!< Addressed as slave, including general call, alert response, primary/secondary address and
                            range address match. This flag can be cleared. */
    kI2C_ByteTransferCompleteInterruptFlag = I2C_S_TCF_MASK,
#ifdef I2C_HAS_STOP_DETECT
    kI2C_StopDetectInterruptFlag = I2C_FLT_STOPF_MASK << 8, /*!< This flag can be cleared. */
#endif /* FSL_FEATURE_I2C_HAS_START_STOP_DETECT / FSL_FEATURE_I2C_HAS_STOP_DETECT */

#if defined(FSL_FEATURE_I2C_HAS_START_STOP_DETECT) && FSL_FEATURE_I2C_HAS_START_STOP_DETECT
    kI2C_StartDetectInterruptFlag = I2C_FLT_STARTF_MASK << 8, /*!< This flag can be cleared. */
#endif                                                        /* FSL_FEATURE_I2C_HAS_START_STOP_DETECT */

    kI2C_SclLowTimeoutFlag = I2C_SMB_SLTF_MASK << 8, /*!< I2C SCL signal low timeout flag. This flag can be cleared. */
    kI2C_BusIdleFlag = I2C_SMB_SHTF1_MASK << 8,      /*!< I2C SCL and SDA both high timeout flag indicating bus idle. */
    kI2C_SdaLowTimeoutInterruptFlag = I2C_SMB_SHTF2_MASK
                                      << 8, /*!< I2C SDA signal low timeout flag. This flag can be cleared. */

    /*! All flags which are clearable. */
    kI2C_StatusAllFlags = kI2C_InterruptPendingFlag | kI2C_RangeAddressMatchInterruptFlag |
                          kI2C_ArbitrationLostInterruptFlag | kI2C_AddressAsSlaveInterruptFlag |
                          kI2C_SclLowTimeoutFlag | kI2C_SdaLowTimeoutInterruptFlag
#if defined(FSL_FEATURE_I2C_HAS_START_STOP_DETECT) && FSL_FEATURE_I2C_HAS_START_STOP_DETECT
                          | kI2C_StartDetectInterruptFlag | kI2C_StopDetectInterruptFlag
#elif defined(FSL_FEATURE_I2C_HAS_STOP_DETECT) && FSL_FEATURE_I2C_HAS_STOP_DETECT
                          | kI2C_StopDetectInterruptFlag
#endif /* FSL_FEATURE_I2C_HAS_START_STOP_DETECT/FSL_FEATURE_I2C_HAS_STOP_DETECT */
    ,
};
/* -------------------------------------- End of Hardware Status Flags Sub-group ------------------------------------ */

/* ----------------------------------------------- Interrupt Sub-group ---------------------------------------------- */
/*!
 * @brief I2C interrupt enable/disable source.
 *
 * These enumerations can be ORed together to form bit masks. The masks can be used as parameter by
 * @ref I2C_EnableInterrupts, @ref I2C_DisableInterrupts, or as return value by @ref I2C_GetEnbaledInterrupts.
 */
enum _i2c_interrupt_enable
{
    kI2C_GlobalInterruptEnable = I2C_C1_IICIE_MASK, /*!< I2C global interrupt. */

#if defined(FSL_FEATURE_I2C_HAS_STOP_DETECT) && FSL_FEATURE_I2C_HAS_STOP_DETECT
    kI2C_StopDetectInterruptEnable = I2C_FLT_STOPIE_MASK, /*!< I2C stop detect interrupt. */
#endif                                                    /* FSL_FEATURE_I2C_HAS_STOP_DETECT */

#if defined(FSL_FEATURE_I2C_HAS_START_STOP_DETECT) && FSL_FEATURE_I2C_HAS_START_STOP_DETECT
    kI2C_StartStopDetectInterruptEnable = I2C_FLT_SSIE_MASK, /*!< I2C start&stop detect interrupt. */
#endif                                                       /* FSL_FEATURE_I2C_HAS_START_STOP_DETECT */

    kI2C_SdaLowTimeoutInterruptEnable = I2C_SMB_SHTF2IE_MASK, /*!< I2C SDA low timeout interrupt. */

    kI2C_AllInterruptEnable = kI2C_GlobalInterruptEnable
#if I2C_SMBUS_ENABLE
//| kI2C_SdaLowTimeoutInterruptEnable
#endif /* I2C_SMBUS_ENABLE */
#if defined(FSL_FEATURE_I2C_HAS_START_STOP_DETECT) && FSL_FEATURE_I2C_HAS_START_STOP_DETECT
                              | kI2C_StartStopDetectInterruptEnable
#elif defined(FSL_FEATURE_I2C_HAS_STOP_DETECT) && FSL_FEATURE_I2C_HAS_STOP_DETECT
                              | kI2C_StopDetectInterruptEnable
#endif /* FSL_FEATURE_I2C_HAS_START_STOP_DETECT/FSL_FEATURE_I2C_HAS_STOP_DETECT */
    ,
};
/* ------------------------------------------- End of Interrupt Sub-group ------------------------------------------- */

/* ------------------------------------------ Module Init/Deinit Sub-group ------------------------------------------ */
/*!
 * @brief I2C master configuration structure.
 *
 * This structure includes all the master operation needed features, user can configure these features one by one
 * manually, or call @ref I2C_MasterGetDefaultConfig to set the structure to default value. Then, call
 * @ref I2C_MasterInit to initialize I2C module. After initialization, the I2C module can only operate as master. To
 * deinitialize I2C, call @ref I2C_MasterDeinit.
 */
typedef struct _i2c_master_config
{
    uint32_t bEnableModule : 1; /*!< Enable the I2C peripheral during initialization. */

