nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_i2c.h
    uint32_t bEnableHighDrive : 1; /* Enable I2C pads high drive capability. I2C_C2_HDRS */
#if defined(FSL_FEATURE_I2C_HAS_DOUBLE_BUFFER_ENABLE) && FSL_FEATURE_I2C_HAS_DOUBLE_BUFFER_ENABLE
    uint32_t
        bEnableDoubleBuffering : 1; /*!< Control double buffer enable. Notice that enabling the double buffer disables
                                       the clock stretch. It is not supported in SMBus system. I2C_S2_DFEN */
#endif                              /* FSL_FEATURE_I2C_HAS_DOUBLE_BUFFER_ENABLE */
#if defined(FSL_FEATURE_I2C_HAS_STOP_HOLD_OFF) && FSL_FEATURE_I2C_HAS_STOP_HOLD_OFF
    uint32_t bEnableStopHold : 1;     /*!< Control the stop hold enable. I2C_FLT_SHEN */
#endif                                /* FSL_FEATURE_I2C_HAS_STOP_HOLD_OFF */
    uint32_t u8GlitchFilterWidth : 8; /*!< Control the width of the glitch filter. I2C_FLT_FLT */
#if I2C_SMBUS_ENABLE
    uint32_t u16SclTimout_Ms : 16; /* SCL high/low time out value. I2C_SMB_TCKSEL, I2C_SLTH_SSLT[8], I2C_SLTL_SSLT[8] */
#endif                             /* I2C_SMBUS_ENABLE */

    uint32_t u8Interrupts : 8; /*!< Mask of the interrupts to be enabled in the init function. */
    uint32_t u32BaudRateBps;   /*!< Baud rate value in bits-per-second. I2C_F_MULT, I2C_F_ICR */
    uint32_t u32SrcClockHz;    /*!< The clock source frequency for I2C module. */
} i2c_master_config_t;

/*! @brief Slave addressing mode, address match or range address match. */
typedef enum _i2c_slave_address_mode
{
    kI2C_AddressMatch      = 0x0U, /*!< 7-bit addressing mode. */
    kI2C_AddressRangeMatch = 0X1U, /*!< Range address match addressing mode. */
    kI2C_AddressMatch10bit = 0X2U, /*!< 10-bit addressing mode. */
} i2c_slave_address_mode_t;

/*!
 * @brief I2C slave configuration structure.
 *
 * This structure includes all the slave operation needed features, user can configure these features one by one
 * manually, or call @ref I2C_SlaveGetDefaultConfig to set the structure to default value. Then, call
 * @ref I2C_SlaveInit to initialize I2C module. After initialization, the I2C module can only operate as slave. To
 * deinitialize I2C, call @ref I2C_SlaveDeinit.
 */
typedef struct _i2c_slave_config
{
    uint32_t bEnableModule : 1; /*!< Enable the I2C peripheral during initialization. */

    uint32_t bEnableHighDrive : 1; /* Enable I2C pads high drive capability. I2C_C2_HDRS */
#if defined(FSL_FEATURE_I2C_HAS_DOUBLE_BUFFER_ENABLE) && FSL_FEATURE_I2C_HAS_DOUBLE_BUFFER_ENABLE
    uint32_t
        bEnableDoubleBuffering : 1; /*!< Control double buffer enable. Notice that enabling the double buffer disables
                                       the clock stretch. It is not supported in SMBus system. I2C_S2_DFEN */
#endif                              /* FSL_FEATURE_I2C_HAS_DOUBLE_BUFFER_ENABLE */
#if defined(FSL_FEATURE_I2C_HAS_STOP_HOLD_OFF) && FSL_FEATURE_I2C_HAS_STOP_HOLD_OFF
    uint32_t bEnableStopHold : 1;     /*!< Control the stop hold enable. I2C_FLT_SHEN */
#endif                                /* FSL_FEATURE_I2C_HAS_STOP_HOLD_OFF */
    uint32_t u8GlitchFilterWidth : 8; /*!< Control the width of the glitch filter. I2C_FLT_FLT */
#if I2C_SMBUS_ENABLE
    uint32_t u16SclTimout_Ms : 16; /* SCL high/low time out value. I2C_SMB_TCKSEL, I2C_SLTH_SSLT[8], I2C_SLTL_SSLT[8] */
#endif                             /* I2C_SMBUS_ENABLE */

    uint32_t bEnableWakeUp : 1; /*!< Enable/disable waking up MCU from low-power mode. I2C_C1_WUEN */
#if !(defined(FSL_FEATURE_I2C_NO_SBRC) && FSL_FEATURE_I2C_NO_SBRC)
    uint32_t bEnableBaudRateCtl : 1; /*!< Enable/disable independent slave baud rate on SCL in very fast I2C modes.
                                        I2C_C2_SBRC */
#endif                               /* FSL_FEATURE_I2C_NO_SBRC */
    uint32_t bEnableGeneralCall : 1; /*!< Enable the general call addressing mode, not affected by address length.
                                        General call address is 0x00. I2C_C2_GCAEN */
    uint32_t
        eAddressingMode : 2; /*!< Addressing mode chosen from @ref i2c_slave_address_mode_e. I2C_C2_ADEXT I2C_C2_RMEN */
    uint32_t bitsPrimaryAddress : 10; /*!< Primary Slave address. I2C_A1_AD[7] I2C_C2_AD[3] */
    uint32_t bitsMaxAddress : 7; /*!< The maximum boundary of slave address used in a range address match addressing. In
                                  range address match, address greater than primary address and less than or equal to
                                  upper address is marked as matched. I2C_RA_RAD[7] */
#if I2C_SMBUS_ENABLE
    uint32_t bEnableAlertResponse : 1;    /*!< Enable the alert response addressing mode. Alert response address is
                                             0b0001100X. I2C_SMB_ALERTEN */
    uint32_t bEnableSecondaryAddress : 1; /*!< Enable the secondary address for SMBus. I2C_SMB_SIICAEN. */
    uint32_t bitsSecondaryAddress : 7;    /*!< Secondary Slave address. I2C_A2_SAD[7] */
#endif                                    /* I2C_SMBUS_ENABLE */
    uint32_t u8Interrupts : 8;            /*!< Mask of the interrupts to be enabled in the init function. */
    uint32_t u32SclStopHoldTime_ns; /*!< the delay from the rising edge of SCL (I2C clock) to the rising edge of SDA
                                    (I2C data) while SCL is high (stop condition), SDA hold time and SCL start hold time
                                    are also configured according to the SCL stop hold time. */
    uint32_t u32SrcClockHz;         /*!< The clock source frequency for I2C module. */
} i2c_slave_config_t;

/*!
 * @brief I2C configuration structure.
 *
 * This structure includes all I2C features, user can configure user can configure these features one by one manually,
 * or call @ref I2C_GetDefaultConfig to set the structure to default value. Then, call @ref I2C_Init to initialize I2C
 * module. To deinitialize I2C, call @ref I2C_Deinit.
 */
typedef struct _i2c_config
{
    uint32_t bEnableModule : 1; /*!< Enable the I2C peripheral during initialization. */

    uint32_t bEnableHighDrive : 1; /* Enable I2C pads high drive capability. I2C_C2_HDRS */
#if defined(FSL_FEATURE_I2C_HAS_DOUBLE_BUFFER_ENABLE) && FSL_FEATURE_I2C_HAS_DOUBLE_BUFFER_ENABLE
    uint32_t
        bEnableDoubleBuffering : 1; /*!< Control double buffer enable. Notice that enabling the double buffer disables
                                       the clock stretch. It is not supported in SMBus system. I2C_S2_DFEN */
#endif                              /* FSL_FEATURE_I2C_HAS_DOUBLE_BUFFER_ENABLE */
#if defined(FSL_FEATURE_I2C_HAS_STOP_HOLD_OFF) && FSL_FEATURE_I2C_HAS_STOP_HOLD_OFF
    uint32_t bEnableStopHold : 1;     /*!< Control the stop hold enable. I2C_FLT_SHEN */
#endif                                /* FSL_FEATURE_I2C_HAS_STOP_HOLD_OFF */
    uint32_t u8GlitchFilterWidth : 8; /*!< Control the width of the glitch filter. I2C_FLT_FLT */
#if I2C_SMBUS_ENABLE
    uint32_t u16SclTimout_Ms : 16; /* SCL high/low time out value. I2C_SMB_TCKSEL, I2C_SLTH_SSLT[8], I2C_SLTL_SSLT[8] */
#endif                             /* I2C_SMBUS_ENABLE */

    uint32_t bEnableWakeUp : 1; /*!< Enable/disable waking up MCU from low-power mode. I2C_C1_WUEN */
#if !(defined(FSL_FEATURE_I2C_NO_SBRC) && FSL_FEATURE_I2C_NO_SBRC)
    uint32_t bEnableBaudRateCtl : 1; /*!< Enable/disable independent slave baud rate on SCL in very fast I2C modes.
                                        I2C_C2_SBRC */
#endif                               /* FSL_FEATURE_I2C_NO_SBRC */
    uint32_t bEnableGeneralCall : 1; /*!< Enable the general call addressing mode, not affected by address length.
                                        General call address is 0x00. I2C_C2_GCAEN */
    uint32_t
        eAddressingMode : 2; /*!< Addressing mode chosen from @ref i2c_slave_address_mode_e. I2C_C2_ADEXT I2C_C2_RMEN */
    uint32_t bitsPrimaryAddress : 10; /*!< Primary Slave address. I2C_A1_AD[7] I2C_C2_AD[3] */
    uint32_t bitsMaxAddress : 7; /*!< The maximum boundary of slave address used in a range address match addressing. In
                                  range address match, address greater than primary address and less than or equal to
                                  upper address is marked as matched. I2C_RA_RAD[7] */
#if I2C_SMBUS_ENABLE
    uint32_t bEnableAlertResponse : 1;    /*!< Enable the alert response addressing mode. Alert response address is
                                             0b0001100X. I2C_SMB_ALERTEN */
    uint32_t bEnableSecondaryAddress : 1; /*!< Enable the secondary address for SMBus. I2C_SMB_SIICAEN. */
    uint32_t bitsSecondaryAddress : 7;    /*!< Secondary Slave address. I2C_A2_SAD[7] */
#endif                                    /* I2C_SMBUS_ENABLE */
    uint32_t u8Interrupts : 8;            /*!< Mask of the interrupts to be enabled in the init function. */
    uint32_t u32BaudRateBps;              /*!< Baud rate value in bits-per-second. I2C_F_MULT, I2C_F_ICR */
    uint32_t u32SrcClockHz;               /*!< The clock source frequency for I2C module. */
} i2c_config_t;

/* --------------------------------------- End of Module Init/Deinit Sub-group -------------------------------------- */

/* ----------------------------------------- Module Configuration Sub-group ----------------------------------------- */
/*! @brief Peripheral data direction. */
typedef enum _i2c_data_direction
{
    kI2C_Read  = 0x0U, /*!< I2C read data from bus. */
    kI2C_Write = 0x1U, /*!< I2C write data to bus. */
} i2c_data_direction_t;
