nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_i2c.h
/* -------------------------------------- End of Module Configuration Sub-group ------------------------------------- */

/* ================================= Transactional Group Structure/Enumeration List  ================================ */
/* -------------------------------------------- Master Transfer Sub-group ------------------------------------------- */
/*!
 * @brief I2C master transfer control flags
 *
 * These flags can be ORed together to form bit mask. The mask is used to configure master transfer's start/stop
 * condition in i2c_master_transfer_t::u8ControlFlagMask.
 */
enum _i2c_master_transfer_control_flags
{
    kI2C_TransferStartStopFlag = 0x0U,     /*!< A transfer starts with a start signal, stops with a stop signal. */
    kI2C_TransferNoStartFlag   = 0x1U,     /*!< A transfer starts without a start signal, only support write only or
                                        write+read with no start flag, do not support read only with no start flag. */
    kI2C_TransferRepeatedStartFlag = 0x2U, /*!< A transfer starts with a repeated start signal. */
    kI2C_TransferNoStopFlag        = 0x4U, /*!< A transfer ends without a stop signal. */
};

/*! @brief Master transfer direction. */
typedef enum _i2c_master_transfer_direction
{
    kI2C_MasterTransmit = 0x0U, /*!< Master transmits data to slave. */
    kI2C_MasterReceive  = 0x1U, /*!< Master receives data from slave. */
} i2c_master_transfer_direction_t;

/*!
 * @brief I2C master transfer configuration structure.
 *
 * This structure definition includes all the user configurable features, that are used to control single I2C transfer
 * of master mode, in polling way or in interrupt way.
 */
typedef struct _i2c_master_transfer
{
    uint8_t u8ControlFlagMask; /*!< The transfer flag which controls the transfer start/stop signal, refer @ref
                          _i2c_master_transfer_flags. */
    uint8_t u8SlaveAddress;    /*!< 7-bit slave address. */
#if I2C_SMBUS_ENABLE
    uint8_t u8RetryTimes;                       /*!< The retry times when master lost arbitration during addressing. */
#endif                                          /* I2C_SMBUS_ENABLE */
    i2c_master_transfer_direction_t eDirection; /*!< Transfer direction, #kI2C_Transmit or #kI2C_Receive. */
    uint8_t *pu8Command;                        /*!< Pointer to command code. */
    uint8_t u8CommandSize;                      /*!< Size of the command code, max value 4. */
    uint8_t *volatile pu8Data;                  /*!< Pointer to the send/receive data buffer. */
    volatile uint16_t u16DataSize;              /*!< Transfer size. */
} i2c_master_transfer_t;

/*! @brief Forward declaration of the I2C master transfer handle structure. */
typedef struct _i2c_master_transfer_handle i2c_master_transfer_handle_t;

/*!
 * @brief I2C master transfer callback function definition
 *
 * Defines the interface of user callback function used in master interrupt transfer. The callback function shall be
 * defined and declared in application level by user. Before starting master transfer by calling
 * @ref I2C_MasterTransferNonBlocking, call @ref I2C_MasterTransferCreateHandle to install the user callback. When
 * master transfer ends successfully or failed due to any event like arbitration lost or nacked by slave, user callback
 * will be invoked by driver. And then user can decide what to do next in the callback according to its third parameter
 * #completionStatus that indicates how the transfer ends.
 *
 * @param psHandle I2C transfer handle, which contains the information of base pointer, completionStatus and user data.
 */
typedef void (*i2c_master_transfer_callback_t)(i2c_master_transfer_handle_t *psHandle);

/*!
 * @brief I2C master transfer handle
 *
 * @note If user wants to use the transactional API to transfer data in interrupt way in master mode, one I2C instance
 * should and can only be allocated one master handle.
 * @note The handle is maintained by I2C driver internally, which means the transfer state is retained and user shall
 * not modify its state #u8State in application level. If user only wish to use transactional APIs without understanding
 * its machanism, it is not necessary to understand these members.
 */
struct _i2c_master_transfer_handle
{
    I2C_Type *base;                  /*!< I2C base pointer to the I2C instance that assigned to this handle. */
    i2c_master_transfer_t sTransfer; /*!< I2C master transfer structure. */
    uint16_t u16TransferSize;        /*!< Total bytes to be transferred. */
    uint8_t u8State;                 /*!< A transfer state maintained during transfer. */
    i2c_master_transfer_callback_t
        pfCompletionCallback;  /*!< Callback function invoked when the transfer is finished. */
    status_t completionStatus; /*!< I2C master transfer complete status, indicating how the transfer ends. */
    void *pUserData; /*!< User configurable pointer to any data, function, structure etc that user wish to use in the
                        callback */
};
/* ----------------------------------------- End of Master Transfer Sub-group --------------------------------------- */

/* --------------------------------------------- Slave Transfer Sub-group ------------------------------------------- */
/*!
 * @brief Set of slave transfer events.
 *
 * This enumeration lists all the protocol level events that may happen during slave transfer. They can be used for two
 * related purposes:
 *  1. User can select certain events and combined them by OR operation to form a mask, and use the mask to configure
 * slave transfer configuration stucture i2c_slave_transfer_t::u8EventMask. If any of these selected events happens,
 * driver will alert user by invoking callback.
 *  2. When slave callback is invoked, user has to know which specific event occured. Callback uses slave transfer
 * configuration structure i2c_slave_transfer_t as 2nd parameter, its member i2c_slave_transfer_t::eEvent shows which
 * event just happened.
 */
typedef enum _i2c_slave_transfer_event
{
    kI2C_SlaveAddressMatchEvent =
        0x01U, /*!< Slave detects general call or alert response address, or primary/secondary/range address is matched
                  after a start or repeated start. */
    kI2C_SlaveOutofTransmitDataEvent = 0x02U, /*!< Slave runs out of data to transmit, request a new data buffer. */
    kI2C_SlaveOutofReceiveSpaceEvent =
        0x04U, /*!< Slave runs out of space to store received data, request a new data buffer. */
#if defined(FSL_FEATURE_I2C_HAS_START_STOP_DETECT) && FSL_FEATURE_I2C_HAS_START_STOP_DETECT
    kI2C_SlaveStartEvent = 0x08U, /*!< A start/repeated start was detected. */
#endif                            /* FSL_FEATURE_I2C_HAS_START_STOP_DETECT */
    kI2C_SlaveCompletionEvent =
        0x10U, /*!< Slave detects a stop signal, or slave is nacked by master during master-receive,
                or slave has finished transmit/receive previously configured amount of data. */
    kI2C_SlaveGenaralcallEvent = 0x20U, /*!< Received the general call address after a start or repeated start. */
#if I2C_SMBUS_ENABLE
    kI2C_SlaveAlertResponseEvent = 0x40U, /*!< Received the alert response address after a start or repeated start. */
#endif                                    /* I2C_SMBUS_ENABLE */
    /*! A bit mask of all available events. */
    kI2C_SlaveAllEvents = kI2C_SlaveAddressMatchEvent | kI2C_SlaveOutofTransmitDataEvent |
                          kI2C_SlaveOutofReceiveSpaceEvent
#if defined(FSL_FEATURE_I2C_HAS_START_STOP_DETECT) && FSL_FEATURE_I2C_HAS_START_STOP_DETECT
                          | kI2C_SlaveStartEvent
#endif /* FSL_FEATURE_I2C_HAS_START_STOP_DETECT */
                          | kI2C_SlaveCompletionEvent | kI2C_SlaveGenaralcallEvent
#if I2C_SMBUS_ENABLE
                          | kI2C_SlaveAlertResponseEvent
#endif /* I2C_SMBUS_ENABLE */

    ,
} i2c_slave_transfer_event_t;

/*!
 * @brief I2C slave transfer configuration structure.
 *
 * Covers slave transfer data buffer pointer, data size and the events user want driver to alert.
 * @note Unlike master who controls the transfer flow, slave has to monitor any bus event and change its configuration
 * accordingly. So this slave transfer configuration structure is also used as second parameter of callback, for user
 * to change the transfer configuration in the callback. The read-only member eEvent shows which event occured that
 * causes the callback being invoked.
 */
typedef struct _i2c_slave_transfer
{
    uint8_t u8EventMask; /*!< Mask of the events. When these enents occur during transfer driver will alert user using
                            callback. */
    uint8_t *volatile pu8Data;         /*!< Pointer to the buffer of data to send, or to store received data. */
    volatile uint16_t u16DataSize;     /*!< Transfer size. */
    i2c_slave_transfer_event_t eEvent; /*!< The event that caused the callback being invoked. Read-only. */
} i2c_slave_transfer_t;

/*! @brief Forward declaration of the I2C slave transfer handle structure. */
typedef struct _i2c_slave_transfer_handle i2c_slave_transfer_handle_t;

/*!
 * @brief I2C slave transfer callback function definition
 *
 * Defines the interface of slave user callback function. The callback function shall be defined and declared in
 * application level by user. Before calling @ref I2C_SlaveTransferNonBlocking to let I2C slave ready to process bus
 * events, call @ref I2C_SlaveTransferCreateHandle first to install the user callback to slave handle. When I2C slave
 * meets user selected events, callback will be invoked and user can decide the following steps in the callback.
 * All the events that can trigger callback are listed in #i2c_slave_transfer_event_t.
 *
 * @param psHandle I2C transfer handle, which contains the information of base pointer, completionStatus transfer data,
 * data length and user data.
 */
typedef void (*i2c_slave_transfer_callback_t)(i2c_slave_transfer_handle_t *psHandle);

/*!
 * @brief I2C slave transfer handle
 *
 * @note If user wants to use the transactional API to transfer data in slave mode, one I2C instance should and can only
 * be allocated one handle.
 * @note The handle is maintained by I2C driver internally, which means the transfer state is retained and user shall
 * not modify its state #u8State in application level. If user only wish to use transactional APIs without understanding
 * its machanism, it is not necessary to understand these members.
 */
struct _i2c_slave_transfer_handle
{
    I2C_Type *base;                           /*!< I2C base pointer to the I2C instance that assigned to this handle. */
    i2c_slave_transfer_t sTransfer;           /*!< I2C slave transfer structure. */
    uint16_t u16TransferredCount;             /*!< The number of bytes actually transferred for curent data buffer. */
    uint8_t u8State;                          /*!< A transfer state maintained during transfer. */
    i2c_slave_transfer_callback_t pfCallback; /*!< Callback function invoked at the transfer event. */
    status_t completionStatus; /*!< I2C slave transfer complete status, indicating how the transfer ends, such as
    #kStatus_I2C_Nak indicates the slave was nacked by master before all the data was sent. This parameter is only
    useful when eEvent is #kI2C_SlaveCompletionEvent. */
    void *pUserData; /*!< User configurable pointer to any data, function, structure etc that user wish to use in the
                        callback. */
};
/* --------------------------------------------- Slave Transfer Sub-group ------------------------------------------- */
/* ========================================= End of Transactional API Group ======================================== */

