nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_i2c.h
/*******************************************************************************
 * API
 ******************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif /*_cplusplus. */

/* =========================================== Functional Group API List ============================================ */
/*!
 * @name Module Init/Deinit Sub-group
 * @{
 */
/*!
 * @brief Sets the I2C master configuration structure to default values.
 *
 * The purpose of this API is to initialize the configuration structure to default value for @ref I2C_MasterInit to use.
 * Use the unchanged structure in @ref I2C_MasterInit or modify the structure before calling @ref I2C_MasterInit.
 * This is an example:
 * @code
 *   i2c_master_config_t config;
 *   I2C_MasterGetDefaultConfig(&config, 12000000U);
 *   config.u32BaudRateBps = 100000;
 *   I2C_MasterInit(I2C0, &config);
 * @endcode
 *
 * @param psMasterConfig Pointer to the master configuration structure.
 * @param u32SrcClockHz The clock source frequency for I2C module.
 */
void I2C_MasterGetDefaultConfig(i2c_master_config_t *psMasterConfig, uint32_t u32SrcClockHz);

/*!
 * @brief Initializes the I2C peripheral to operate as master.
 *
 * This API initialize the I2C module for master operation, including the feature configuration of high drive capacity,
 * doubble buffer, glitch filter, SCL timeout value, stop hold off enable and transfer baudrate. User can also configure
 * whether to enable the module in the function.
 *
 * @note If FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL is enbaled by user, the init function will not ungate I2C clock source
 * before initialization, to avoid hardfault, user has to manually enable ungate the clock source before calling the API
 *
 * The configuration structure can be filled manully or be set with default values by calling
 * @ref I2C_MasterGetDefaultConfig. This is an example.
 * @code
 *   I2C_MasterGetDefaultConfig(&config, 12000000U);
 *   I2C_MasterInit(I2C0, &config);
 * @endcode
 *
 * @param base I2C base pointer
 * @param psMasterConfig Pointer to the master configuration structure
 */
void I2C_MasterInit(I2C_Type *base, const i2c_master_config_t *psMasterConfig);

/*!
 * @brief De-initializes the I2C peripheral. Call this API to disable the I2C module.
 *
 * @param base I2C base pointer
 */
void I2C_MasterDeinit(I2C_Type *base);

/*!
 * @brief Sets the I2C slave configuration structure to default values.
 *
 * The purpose of this API is to initialize the configuration structure for @ref I2C_SlaveInit to use. Use the unchanged
 * initialized structure in @ref I2C_SlaveInit or modify the structure before calling @ref I2C_SlaveInit.
 * This is an example.
 * @code
 *   i2c_slave_config_t config;
 *   I2C_SlaveGetDefaultConfig(&config, 0x23U, 12000000U);
 * @endcode
 *
 * @param psSlaveConfig Pointer to the slave configuration structure.
 * @param u16PrimaryAddress For 7-bit address low 7-bit is used, for 10-bit address low 10-bit is used.
 * @param u32SrcClockHz The clock source frequency for I2C module.
 */
void I2C_SlaveGetDefaultConfig(i2c_slave_config_t *psSlaveConfig, uint16_t u16PrimaryAddress, uint32_t u32SrcClockHz);

/*!
 * @brief Initializes the I2C peripheral to operate as slave.
 *
 * This API initialize the I2C module for slave operation, including the feature configuration of high drive capacity,
 * doubble buffer, glitch filter, SCL timeout value, stop hold off enable, addressing mode, alert response/general call
 * minitoring, auto baudrate control, low power mode wake up, SCL/SDA setup and hold time. User can also configure
 * whether to enable the module in the function.
 *
 * @note If FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL is enbaled by user, the init function will not ungate I2C clock source
 * before initialization, to avoid hardfault, user has to manually enable ungate the clock source before calling the API
 *
 * The configuration structure can be filled manully or be set with default values by calling
 * @ref I2C_SlaveGetDefaultConfig. This is an example.
 * @code
 *    i2c_slave_config_t sConfig;
 *    I2C_SlaveGetDefaultConfig(&sConfig, 12000000U);
 *    sConfig.u8PrimaryAddress = 0x2AU;
 *    I2C_SlaveInit(I2C0, &sConfig);
 * @endcode
 *
 * @param base I2C base pointer
 * @param psSlaveConfig Pointer to the slave configuration structure
 */
void I2C_SlaveInit(I2C_Type *base, const i2c_slave_config_t *psSlaveConfig);

/*!
 * @brief De-initializes the I2C peripheral. Call this API to disable the I2C module.
 *
 * @param base I2C base pointer
 */
static void I2C_SlaveDeinit(I2C_Type *base)
{
    I2C_MasterDeinit(base);
}

/*!
 * @brief Sets the I2C configuration structure to default values.
 *
 * The purpose of this API is to initialize the configuration structure for @ref I2C_Init to use. Use the unchanged
 * initialized structure in @ref I2C_Init or modify the structure before calling @ref I2C_Init.
 * This is an example.
 * @code
 *   i2c_config_t config;
 *   I2C_GetDefaultConfig(&config, 0x23U, 12000000U);
 * @endcode
 *
 * @param psConfig Pointer to the slave configuration structure.
 * @param u16PrimaryAddress For 7-bit address low 7-bit is used, for 10-bit address low 10-bit is used.
 * @param u32SrcClockHz The clock source frequency for I2C module.
 */
void I2C_GetDefaultConfig(i2c_config_t *psConfig, uint16_t u16PrimaryAddress, uint32_t u32SrcClockHz);

/*!
 * @brief Initializes the I2C peripheral.
 *
 * This API initialize the I2C module, including the feature configuration of high drive capacity, doubble buffer,
 * glitch filter, SCL timeout value, stop hold off enable, addressing mode, alert response/general call minitoring, auto
 * baudrate control, low power mode wake up and baudrate. User can also configure whether to enable the module in the
 * function.
 *
 * @note If FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL is enbaled by user, the init function will not ungate I2C clock source
 * before initialization, to avoid hardfault, user has to manually enable ungate the clock source before calling the API
 *
 * The configuration structure can be filled manully or be set with default values by calling @ref I2C_GetDefaultConfig.
 * This is an example.
 * @code
 *   i2c_config_t sConfig;
 *   I2C_GetDefaultConfig(&sConfig, 0x23U, 12000000U);
 *   I2C_Init(I2C0, &sConfig);
 * @endcode
 *
 * @param base I2C base pointer
 * @param psConfig Pointer to the I2C configuration structure
 */
void I2C_Init(I2C_Type *base, const i2c_config_t *psConfig);

/*!
 * @brief De-initializes the I2C peripheral. Call this API to disable the I2C module.
 *
 * @param base I2C base pointer
 */
static void I2C_Deinit(I2C_Type *base)
{
    I2C_MasterDeinit(base);
}
/* @} */

/*!
 * @name Hardware Status Flags Sub-group
 * @{
 */
/*!
 * @brief Gets the I2C master hardware status flags.
 *
 * @param base I2C base pointer
 * @return the mask of status flags, can be a single flag or several flags in #_i2c_status_flags ORed together.
 */
uint16_t I2C_MasterGetStatusFlags(I2C_Type *base);

/*!
 * @brief Clears the I2C master status flags.
 *
 * @param base I2C base pointer
 * @param u16StatusFlags The status flag mask, can be a single flag or several flags in #_i2c_status_flags ORed
 * together. These flags among #_i2c_status_flags can be cleared:
 *          @arg kI2C_StartDetectInterruptFlag (only supported on certain SoCs)
 *          @arg kI2C_StopDetectInterruptFlag (only supported on certain SoCs)
 *          @arg kI2C_ArbitrationLostInterruptFlag
 *          @arg kI2C_InterruptPendingFlag
 *          @arg kI2C_RangeAddressMatchInterruptFlag
 *          @arg kI2C_AddressAsSlaveInterruptFlag
 *          @arg kI2C_SclLowTimeoutFlag
 *          @arg kI2C_SdaLowTimeoutInterruptFlag
 */
static inline void I2C_MasterClearStatusFlags(I2C_Type *base, uint16_t u16StatusFlags)
{
#if defined(FSL_FEATURE_I2C_HAS_START_STOP_DETECT) && FSL_FEATURE_I2C_HAS_START_STOP_DETECT
    /* Must clear the STARTF bits prior to clearing IICIF */
    if (0U != (u16StatusFlags & (uint16_t)kI2C_StartDetectInterruptFlag))
    {
        base->FLT |= I2C_FLT_STARTF_MASK;
    }
#endif /* FSL_FEATURE_I2C_HAS_START_STOP_DETECT */

#ifdef I2C_HAS_STOP_DETECT
    /* Must clear the STOPF bits prior to clearing IICIF */
    if (0U != (u16StatusFlags & (uint16_t)kI2C_StopDetectInterruptFlag))
    {
        base->FLT |= I2C_FLT_STOPF_MASK;
    }
#endif

