nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_i2c.h
    /* Clear the SCL low timeout flags. */
    if (0U != (u16StatusFlags & (uint16_t)kI2C_SclLowTimeoutFlag))
    {
        base->SMB |= (uint8_t)I2C_SMB_SLTF_MASK;
    }

    /* Clear the SDA low timeout flags. */
    if (0U != (u16StatusFlags & (uint16_t)kI2C_SdaLowTimeoutInterruptFlag))
    {
        base->SMB |= (uint8_t)I2C_SMB_SHTF2_MASK;
    }

    /* Clear interrupt pending and arbitration lost flag by writing 1 to these bits. */
    if (0U != (u16StatusFlags & (uint16_t)(kI2C_InterruptPendingFlag | kI2C_ArbitrationLostInterruptFlag)))
    {
        base->S |= (uint8_t)u16StatusFlags;
    }

    /* Clear address match flags by writing any value to C1. */
    if (0U != (u16StatusFlags & (uint16_t)(kI2C_RangeAddressMatchInterruptFlag | kI2C_AddressAsSlaveInterruptFlag)))
    {
        base->C1 = base->C1;
    }
}

/*!
 * @brief Gets the I2C slave hardware status flags.
 *
 * @param base I2C base pointer
 * @return the mask of status flags, can be a single flag or several flags in #_i2c_status_flags ORed together.
 */
static inline uint16_t I2C_SlaveGetStatusFlags(I2C_Type *base)
{
    return I2C_MasterGetStatusFlags(base);
}

/*!
 * @brief Clears the I2C slave status flags.
 *
 * @param base I2C base pointer
 * @param u16StatusFlags The status flag mask, can be a single flag or several flags in #_i2c_status_flags ORed
 * together. These flags among #_i2c_status_flags can be cleared:
 *          @arg kI2C_StartDetectInterruptFlag (only supported on certain SoCs)
 *          @arg kI2C_StopDetectInterruptFlag (only supported on certain SoCs)
 *          @arg kI2C_ArbitrationLostInterruptFlag
 *          @arg kI2C_InterruptPendingFlag
 *          @arg kI2C_RangeAddressMatchInterruptFlag
 *          @arg kI2C_AddressAsSlaveInterruptFlag
 *          @arg kI2C_SclLowTimeoutFlag
 *          @arg kI2C_SdaLowTimeoutInterruptFlag
 */
static inline void I2C_SlaveClearStatusFlags(I2C_Type *base, uint16_t u16StatusFlags)
{
    I2C_MasterClearStatusFlags(base, u16StatusFlags);
}
/* @} */

/*!
 * @name Interrupt Sub-group
 * @{
 */
/*!
 * @brief Enables I2C interrupt source.
 *
 * @note Before enabling kI2C_GlobalInterruptEnable, check kI2C_RangeAddressMatchInterruptFlag and
 * kI2C_AddressAsSlaveInterruptFlag first, because any write operation on C1 will clear these 2 bits.
 *
 * @param base I2C base pointer
 * @param u8Interrupts The interrupt source mask, can be a single source or several sources in #_i2c_interrupt_enable
 * ORed together.
 */
void I2C_EnableInterrupts(I2C_Type *base, uint8_t u8Interrupts);

/*!
 * @brief Disables I2C interrupt source.
 *
 * @note Before disabling kI2C_GlobalInterruptEnable, check kI2C_RangeAddressMatchInterruptFlag and
 * kI2C_AddressAsSlaveInterruptFlag first, because any write operation on C1 will clear these 2 bits.
 *
 * @param base I2C base pointer
 * @param u8Interrupts The interrupt source mask, can be a single source or several sources in #_i2c_interrupt_enable
 * ORed together.
 */
void I2C_DisableInterrupts(I2C_Type *base, uint8_t u8Interrupts);

/*!
 * @brief Get all the enabled interrupt sources.
 *
 * @param base I2C base pointer
 * @return The interrupt source mask, can be a single source or several sources in #_i2c_interrupt_enable ORed
 * together.
 */
uint8_t I2C_GetEnabledInterrupts(I2C_Type *base);
/* @} */

/*!
 * @name Common Peripheral Configuration Sub-group
 * @{
 */
/*!
 * @brief Returns whether the I2C module is in master mode.
 *
 * @param base I2C base pointer
 * @return True for master mode, false for slave mode.
 */
static inline bool I2C_IsMaster(I2C_Type *base)
{
    return (0U != (base->C1 & (uint8_t)I2C_C1_MST_MASK));
}

/*!
 * @brief Sets the I2C register value to reset value.
 *
 * @param base I2C base pointer
 */
static void I2C_Reset(I2C_Type *base)
{
    base->A1 = 0;
    base->F  = 0;
    base->C1 = 0;
    base->S  = 0xFFU;
    base->C2 = 0;
#if defined(FSL_FEATURE_I2C_HAS_START_STOP_DETECT) && FSL_FEATURE_I2C_HAS_START_STOP_DETECT
    base->FLT = 0x50U;
#elif defined(FSL_FEATURE_I2C_HAS_STOP_DETECT) && FSL_FEATURE_I2C_HAS_STOP_DETECT
    base->FLT = 0x40U;
#endif /* FSL_FEATURE_I2C_HAS_START_STOP_DETECT */
    base->RA  = 0;
    base->SMB = 0;
    base->A2  = 0xC2;
}

/*!
 * @brief Enables or disables the I2C peripheral operation.
 *
 * @param base I2C base pointer
 * @param bEnable Pass true to enable and false to disable the module.
 */
static inline void I2C_Enable(I2C_Type *base, bool bEnable)
{
    if (bEnable)
    {
        base->C1 |= I2C_C1_IICEN_MASK;
    }
    else
    {
        base->C1 &= ~(uint8_t)I2C_C1_IICEN_MASK;
    }
}

/*!
 * @brief Enables/Disables fast NACK/ACK feature.
 *
 * When enbled, writing 0/1 to TXAK generates an ACK/NACK after receiving a data byte, when disabled, writing 0/1 to
 * TXAK generates an ACK/NACK on the following receiving data byte.
 *
 * @param base I2C base pointer
 * @param True to bEnable, false to disable.
 */
static inline void I2C_EnableFastAck(I2C_Type *base, bool bEnable)
{
    if (bEnable)
    {
        base->SMB |= (uint8_t)I2C_SMB_FACK_MASK;
    }
    else
    {
        base->SMB &= ~(uint8_t)I2C_SMB_FACK_MASK;
    }
}

/*!
 * @brief Enables/Disables high drive.
 *
 * @param base I2C base pointer
 * @param True to bEnable, false to disable.
 */
static inline void I2C_EnableHighDrive(I2C_Type *base, bool bEnable)
{
    if (bEnable)
    {
        base->C2 |= (uint8_t)I2C_C2_HDRS_MASK;
    }
    else
    {
        base->C2 &= ~(uint8_t)I2C_C2_HDRS_MASK;
    }
}

#if defined(FSL_FEATURE_I2C_HAS_DOUBLE_BUFFER_ENABLE) && FSL_FEATURE_I2C_HAS_DOUBLE_BUFFER_ENABLE
/*!
 * @brief Enables/Disables double buffer.
 *
 * @param base I2C base pointer
 * @param True to bEnable, false to disable.
 */
static inline void I2C_EnableDoubleBuffer(I2C_Type *base, bool bEnable)
{
    if (bEnable)
    {
        base->S2 |= (uint8_t)I2C_S2_DFEN_MASK;
    }
    else
    {
        base->S2 &= ~(uint8_t)I2C_S2_DFEN_MASK;
    }
}
#endif /* FSL_FEATURE_I2C_HAS_DOUBLE_BUFFER_ENABLE */

#if defined(FSL_FEATURE_I2C_HAS_STOP_HOLD_OFF) && FSL_FEATURE_I2C_HAS_STOP_HOLD_OFF
/*!
 * @brief Enables/Disables double buffer.
 *
 * @param base I2C base pointer
 * @param True to bEnable, false to disable.
 */
static inline void I2C_EnableStopHold(I2C_Type *base, bool bEnable)
{
    if (bEnable)
    {
        base->FLT |= (uint8_t)I2C_FLT_SHEN_MASK;
    }
    else
    {
        base->FLT &= ~(uint8_t)I2C_FLT_SHEN_MASK;
    }
}
#endif /* FSL_FEATURE_I2C_HAS_STOP_HOLD_OFF */

/*!
 * @brief Sets I2C module data direction.
 *
 * @param base I2C base pointer
 * @param eDataDirection #kI2C_Write to write data to bus, #kI2C_Read to read data from bua
 */
static inline void I2C_SetTransferDirection(I2C_Type *base, i2c_data_direction_t eDataDirection)
{
    if (kI2C_Write == eDataDirection)
    {
        base->C1 |= (uint8_t)I2C_C1_TX_MASK;
    }
    else
    {
        base->C1 &= ~(uint8_t)(I2C_C1_TX_MASK | I2C_C1_TXAK_MASK);
    }
}

/*!
 * brief Sets the I2C SCL timeout value.
 *
 * After the I2C module is initialized, user can call this function to change the timeout value.
 *
 * param base I2C base pointer.
 * param u16SclTimout_Ms The SCL timeout value in ms.
 * param u32SrcClockHz I2C peripheral clock frequency in Hz
 */
void I2C_SetSclTimeoutValue(I2C_Type *base, uint16_t u16SclTimout_Ms, uint32_t u32SrcClockHz);

/*!
 * brief Sets the I2C master glitch filter width.
 *
 * After the I2C module is initialized as master, user can call this function to change the glitch filter width.
 *
 * param base I2C base pointer.
 * param u16GlitchFilter_Ns The GLitch filter length in nano seconds.
 * param u32SrcClockHz I2C peripheral clock frequency in Hz
 */
void I2C_SetGlitchFilter(I2C_Type *base, uint16_t u16GlitchFilter_Ns, uint32_t u32SrcClockHz);

