nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_i2c.h
#if defined(FSL_FEATURE_I2C_HAS_DMA_SUPPORT) && FSL_FEATURE_I2C_HAS_DMA_SUPPORT
/*!
 * @brief Enables/disables the I2C DMA request.
 *
 * @param base I2C base pointer
 * @param bEnable true to enable, false to disable
 */
static inline void I2C_EnableDMA(I2C_Type *base, bool bEnable)
{
    if (bEnable)
    {
        base->C1 |= I2C_C1_DMAEN_MASK;
    }
    else
    {
        base->C1 &= ~(uint8_t)I2C_C1_DMAEN_MASK;
    }
}

/*!
 * @brief Gets the I2C data register address. This API is used to provide the transfer address for I2C DMA transfer.
 *
 * @param base I2C base pointer
 * @return data register address
 */
static inline uint32_t I2C_GetDataRegAddr(I2C_Type *base)
{
    return (uint32_t)((void *)(&(base->D)));
}
#endif /* FSL_FEATURE_I2C_HAS_DMA_SUPPORT */
/* @} */

/*!
 * @name Slave Peripheral Configuration Sub-group
 * @{
 */
/*!
 * @brief Enables/Disables alert response.
 *
 * When enbled, I2C slave will monitor the bus line, and when alert response address is received address match status
 * flag will be set.
 *
 * @param base I2C base pointer
 * @param True to bEnable, false to disable.
 */
static inline void I2C_SlaveEnableAlertResponse(I2C_Type *base, bool bEnable)
{
    if (bEnable)
    {
        base->SMB |= (uint8_t)I2C_SMB_ALERTEN_MASK;
    }
    else
    {
        base->SMB &= ~(uint8_t)I2C_SMB_ALERTEN_MASK;
    }
}

/*!
 * @brief Enables/Disables secondary address.
 *
 * @param base I2C base pointer
 * @param True to bEnable, false to disable.
 */
static inline void I2C_SlaveEnableSecondaryAddress(I2C_Type *base, bool bEnable)
{
    if (bEnable)
    {
        base->SMB |= (uint8_t)I2C_SMB_SIICAEN_MASK;
    }
    else
    {
        base->SMB &= ~(uint8_t)I2C_SMB_SIICAEN_MASK;
    }
}

/*!
 * @brief Enables/Disables general call.
 *
 * @param base I2C base pointer
 * @param True to bEnable, false to disable.
 */
static inline void I2C_SlaveEnableGeneralCall(I2C_Type *base, bool bEnable)
{
    if (bEnable)
    {
        base->C2 |= (uint8_t)I2C_C2_GCAEN_MASK;
    }
    else
    {
        base->C2 &= ~(uint8_t)I2C_C2_GCAEN_MASK;
    }
}

/*!
 * @brief Enables/Disables slave low power wakeup.
 *
 * @param base I2C base pointer
 * @param True to bEnable, false to disable.
 */
static inline void I2C_SlaveEnableWakeUp(I2C_Type *base, bool bEnable)
{
    if (bEnable)
    {
        base->C1 |= (uint8_t)I2C_C1_WUEN_MASK;
    }
    else
    {
        base->C1 &= ~(uint8_t)I2C_C1_WUEN_MASK;
    }
}

/*!
 * @brief Configure the slave addressing mode.
 *
 * After the I2C module is initialized as slave, user can call this function to change the configuration of slave
 * addressing mode.
 *
 * @param base I2C base pointer.
 * @param eAddressingMode The slave addressing mode, single address or range address.
 * @param u16Address I2C slave address. For 7-bit address low 7-bit is used, for 10-bit address low 10-bit is used.
 * @param u8MaxAddress The maximum boundary of slave address used in a range address match.
 */
void I2C_SlaveSetAddressingMode(I2C_Type *base,
                                i2c_slave_address_mode_t eAddressingMode,
                                uint16_t u16Address,
                                uint8_t u8MaxAddress);
/* @} */

/*!
 * @name Master Peripheral Configuration Sub-group
 * @{
 */
/*!
 * @brief Sets the I2C master transfer baud rate.
 *
 * After the I2C module is initialized as master, user can call this function to change the transfer baud rate.
 *
 * @param base I2C base pointer.
 * @param u32BaudRateBps the baud rate value in bits-per-second.
 * @param u32SrcClockHz I2C peripheral clock frequency in Hz
 */
void I2C_MasterSetBaudRate(I2C_Type *base, uint32_t u32BaudRateBps, uint32_t u32SrcClockHz);
/* @} */

/*!
 * @name Common Bus Operation Sub-Group
 * @{
 */
/*!
 * @brief Reads one byte from data register directly.
 *
 * @param base I2C base pointer
 * @return The data read from data register.
 */
static inline uint8_t I2C_ReadByte(I2C_Type *base)
{
    return (uint8_t)base->D;
}

/*!
 * @brief Writes one byte to the data register directly.
 *
 * @param base I2C base pointer
 * @param u8Data The byte to write.
 */
static inline void I2C_WriteByte(I2C_Type *base, uint8_t u8Data)
{
    base->D = u8Data;
}

/*!
 * @brief Sends an acknowledge/non-acknowledge signal to the bus on the following receiving byte
 * if SMB[FACK] is cleared, or on the current receiving byte if SMB[FACK] is set.
 *
 * @param base I2C base pointer
 * @param bIsAck True to send ACK signal, false to send NACK signal
 */
static inline void I2C_SendAck(I2C_Type *base, bool bIsAck)
{
    if (bIsAck)
    {
        base->C1 &= ~(uint8_t)I2C_C1_TXAK_MASK;
    }
    else
    {
        base->C1 |= (uint8_t)I2C_C1_TXAK_MASK;
    }
}
/* @} */

/*!
 * @name Master Bus Operation Sub-Group
 * @{
 */
/*!
 * @brief Sends a START signal on the I2C bus then the 7-bit slave address with transmit/receive bit
 *
 * This function is used to initiate a new transfer in master mode, by sending a START signal, then the slave address
 * with transmit/receive bit to I2C bus.
 *
 * @note The return value of this API only indicates whether the start signal is sent to bus, user has to check
 * #kI2C_ArbitrationLostInterruptFlag and #kI2C_ReceiveNakFlag using @ref I2C_MasterClearStatusFlags to see if
 * valid slave device is avaliable or the aribitration is lost.
 *
 * @param base I2C base pointer
 * @param u8Address 7-bit slave device address.
 * @param eDirection Master transfer directions(transmit/receive).
 * @retval #kStatus_I2C_Timeout Transfer error, timeout happens when waiting for status flags to change.
 * @retval kStatus_Success Successfully send the start signal.
 * @retval kStatus_I2C_Busy Current bus is busy.
 */
status_t I2C_MasterStart(I2C_Type *base, uint8_t u8Address, i2c_master_transfer_direction_t eDirection);

/*!
 * @brief Sends a repeated START signal, then the 7-bit slave address with transmit/receive bit to I2C bus.
 *
 * @param base I2C peripheral base pointer
 * @param u8Address 7-bit slave device address.
 * @param eDirection Master transfer directions(transmit/receive).
 * @retval #kStatus_I2C_Timeout Transfer error, timeout happens when waiting for status flags to change.
 * @retval kStatus_Success Successfully send the start signal.
 * @retval kStatus_I2C_Busy Current bus is busy but not occupied by current I2C master.
 */
status_t I2C_MasterRepeatedStart(I2C_Type *base, uint8_t u8Address, i2c_master_transfer_direction_t eDirection);

/*!
 * @brief Sends a STOP signal on the I2C bus.
 *
 * @param base I2C base pointer
 * @retval kStatus_Success Successfully send the stop signal.
 * @retval kStatus_I2C_Timeout Send stop signal failed, timeout.
 */
status_t I2C_MasterStop(I2C_Type *base);

/*!
 * @brief Sends a piece of data to I2C bus in master mode in blocking way.
 *
 * Call this function when using I2C as master to send certain bytes of data to bus when start signal is already sent.
 * User can specify whether to send a stop siganl after the data. This function uses the blocking way, which means it
 * does not return until all the data is sent to bus and stop signal is successfully issued(if user configures the stop
 * signal).
 *
 * @param base I2C base pointer.
 * @param pu8TxBuff The pointer to the data to be transmitted.
 * @param txSize The length in bytes of the data to be transmitted.
 * @param bSendStop Whether to send stop signal after the data transfer.
 * @retval kStatus_Success Successfully complete the data transmission.
 * @retval kStatus_I2C_ArbitrationLost Transfer error, arbitration lost.
 * @retval kStataus_I2C_Nak Transfer error, receive NAK during transfer.
 * @retval #kStatus_I2C_Timeout Transfer error, timeout happens when waiting for status flags to change.
 */
status_t I2C_MasterWriteBlocking(I2C_Type *base, const uint8_t *pu8TxBuff, uint16_t txSize, bool bSendStop);

/*!
 * @brief Receives a piece of data from I2C bus in master mode in blocking way.
 *
 * Call this function when using I2C as master to receive certain bytes of data from bus when start signal is already
 * sent. User can specify whether to send a stop siganl after the data. This function uses the blocking way, which means
 * it does not return until all the data has been received and stop signal is successfully issued(if user configures the
 * stop signal).
 *
 * @note If user configures to send stop signal after the data, this function stops the bus before reading the final
 * byte from data register. Without stopping the bus prior to the final read, the bus will issue another read, resulting
 * in garbage data being read into the data register.
 *
 * @param base I2C base pointer.
 * @param pu8RxBuff The pointer to the data to store the received data.
 * @param rxSize The length in bytes of the data to be received.
 * @param bSendStop Whether to send stop signal after the data transfer.
 * @retval kStatus_Success Successfully complete the data transmission.
 * @retval kStatus_I2C_Timeout Send stop signal failed, timeout.
 */
status_t I2C_MasterReadBlocking(I2C_Type *base, uint8_t *pu8RxBuff, uint16_t rxSize, bool bSendStop);
/* @} */

/*!
 * @name Slave Bus Operation Sub-Group
 * @{
 */
/*!
 * @brief Sends a piece of data to I2C bus in slave mode in blocking way.
 *
 * Call this funtion to let I2C slave poll register status until it is addressed, then slave sends txSize of data to bus
 * until all the data has been sent to bus or untill it is nacked.
 *
 * @param base I2C base pointer.
 * @param pu8TxBuff The pointer to the data to be transferred.
 * @param txSize The length in bytes of the data to be transferred.
 * @retval kStatus_Success Successfully complete the data transmission.
 * @retval kStatus_I2C_ArbitrationLost Transfer error, arbitration lost.
 * @retval kStataus_I2C_Nak Transfer error, receive NAK during transfer.
 * @retval #kStatus_I2C_Timeout Transfer error, timeout happens when waiting for status flags to change.
 */
status_t I2C_SlaveWriteBlocking(I2C_Type *base, const uint8_t *pu8TxBuff, uint16_t txSize);

/*!
 * @brief Receives a piece of data from I2C bus in slave mode in blocking way.
 *
 * Call this funtion to let I2C slave poll register status until it is addressed, then slave receives rxSize of data
 * until all the data has been received.
 *
 * @param base I2C base pointer.
 * @param pu8RxBuff The pointer to the data to store the received data.
 * @param rxSize The length in bytes of the data to be received.
 * @retval kStatus_Success Successfully complete data receive.
 * @retval kStatus_I2C_Timeout Wait status flag timeout.
 */
status_t I2C_SlaveReadBlocking(I2C_Type *base, uint8_t *pu8RxBuff, uint16_t rxSize);
/* @} */
/* =========================================== End of Functional API Group ========================================== */

/* ============================================ Transactional API Group ============================================= */
/*!
 * @name Master Transfer Sub-group
 * @{
 */
/*!
 * @brief Performs a master polling transfer on the I2C bus.
 *
 * @note The API does not return until the transfer succeeds or fails due to arbitration lost or receiving a NAK.
 *
 * @param base I2C peripheral base address.
 * @param psTransferConfig Pointer to the transfer configuration structure.
 * @retval kStatus_Success Successfully complete the data transmission.
 * @retval #kStatus_I2C_Busy Previous transmission still not finished.
 * @retval #kStatus_I2C_Timeout Transfer error, timeout happens when waiting for status flagsto change.
 * @retval #kStatus_I2C_ArbitrationLost Transfer error, arbitration lost.
 * @retval #kStataus_I2C_Nak Transfer error, receive NAK during transfer.
 */
status_t I2C_MasterTransferBlocking(I2C_Type *base, i2c_master_transfer_t *psTransferConfig);

/*!
 * @brief Initializes the I2C master transfer in interrupt way.
 *
 * This function is responsible for initializig master transfer psHandle, installing user callback, registering master
 * IRQ handling function and opening global interrupt.
 *
 * @param base I2C base pointer.
 * @param psHandle pointer to i2c_master_transfer_handle_t structure to store the transfer state.
 * @param pfCallback pointer to user callback function.
 * @param pUserData User configurable pointer to any data, function, structure etc that user wish to use in the callback
 */
void I2C_MasterTransferCreateHandle(I2C_Type *base,
                                    i2c_master_transfer_handle_t *psHandle,
                                    i2c_master_transfer_callback_t pfCallback,
                                    void *pUserData);

/*!
 * @brief Initiates a master transfer on the I2C bus in interrupt way.
 *
 * @note Transfer in interrupt way is non-blocking which means this API returns immediately after transfer initiates.
 * User can call @ref I2C_MasterTransferGetCount to get the count of data that master has transmitted/received and check
 * transfer status. If the return status is kStatus_NoTransferInProgress, the transfer is finished. Also if user
 * installs a user callback when calling @ref I2C_MasterTransferCreateHandle before, the callback will be invoked when
 * transfer finishes.
 *
 * @param psHandle pointer to i2c_master_transfer_handle_t structure which stores the transfer state.
 * @param psTransferConfig Pointer to the transfer configuration structure.
 * @retval kStatus_Success Successfully start the data transmission.
 * @retval #kStatus_I2C_Busy Previous transmission still not finished.
 * @retval #kStatus_I2C_Timeout Transfer error, timeout happens when waiting for status flagsto change.
 */
status_t I2C_MasterTransferNonBlocking(i2c_master_transfer_handle_t *psHandle, i2c_master_transfer_t *psTransferConfig);

/*!
 * @brief Gets the master transfer count and status during a interrupt transfer.
 *
 * @param base I2C base pointer.
 * @param psHandle pointer to i2c_master_transfer_handle_t structure which stores the transfer state.
 * @param count Pointer to number of bytes transferred so far by the non-blocking transaction.
 * @retval kStatus_InvalidArgument count is Invalid.
 * @retval kStatus_NoTransferInProgress Curent no transfer is in progress.
 * @retval kStatus_Success Successfully obtained the count.
 */
status_t I2C_MasterTransferGetCount(i2c_master_transfer_handle_t *psHandle, uint16_t *count);

/*!
 * @brief Aborts an in-process transfer in interrupt way.
 *
 * @note This API can be called at any time after a transfer of interrupt way initiates and before it finishes to abort
 * the transfer early.
 *
 * @param base I2C base pointer.
 * @param psHandle pointer to i2c_master_transfer_handle_t structure which stores the transfer state
 * @retval #kStatus_I2C_Busy Master lost arbitration, bus is in use by other master.
 * @retval #kStatus_I2C_Timeout Transfer error, timeout happens when waiting for status flags to change.
 * @retval kStatus_Success Successfully abort the transfer.
 */
status_t I2C_MasterTransferAbort(i2c_master_transfer_handle_t *psHandle);
/* @} */

/*!
 * @name Slave Transfer Sub-group
 * @{
 */
/*!
 * @brief Initializes the I2C slave transfer in interrupt way.
 *
 * This function is responsible for initializig slave transfer handle, installing user callback, registering slave IRQ
 * handling function and opening global interrupt.
 *
 * @param base I2C base pointer.
 * @param psHandle pointer to i2c_slave_transfer_handle_t structure to store the transfer state.
 * @param pfCallback pointer to user callback function.
 * @param pUserData User configurable pointer to any data, function, structure etc that user wish to use in the callback
 */
void I2C_SlaveTransferCreateHandle(I2C_Type *base,
                                   i2c_slave_transfer_handle_t *psHandle,
                                   i2c_slave_transfer_callback_t pfCallback,
                                   void *pUserData);

/*!
 * @brief Sets I2C slave ready to process bus events.
 *
 * Call this API to let I2C start monitoring bus events driven by I2C master on bus. When user specified event occurs,
 * callback will be invoked passes event information to the callback.
 *
 * @note When #kI2C_SlaveOutofTransmitDataEvent and #kI2C_SlaveOutofReceiveSpaceEvent occured, slave callback will
 * always be revoked regardless which events user choose to enable. This means user need not configure them in the
 * psTransferConfig. If user wants to enable all the events, use #kI2C_SlaveAllEvents for convenience.
 *
 * @param base The I2C peripheral base address.
 * @param psHandle Pointer to #i2c_slave_transfer_handle_t structure which stores the transfer state.
 * @param psTransferConfig I2C transfer configuration.
 * @retval kStatus_Success I2C slave set to standby state successfully and ready to process events.
 * @retval kStatus_I2C_Busy I2C slave has already been started on this handle.
 */
status_t I2C_SlaveTransferNonBlocking(i2c_slave_transfer_handle_t *psHandle, i2c_slave_transfer_t *psTransferConfig);

/*!
 * @brief Gets how many bytes slave have transferred in curent data buffer.
 *
 * @param base I2C base pointer.
 * @param psHandle pointer to i2c_slave_transfer_handle_t structure.
 * @param count Number of bytes slave have transferred after the last start/repeated start.
 * @retval kStatus_InvalidArgument count is Invalid.
 * @retval kStatus_NoTransferInProgress Curent no transfer is in progress.
 * @retval kStatus_Success Successfully obtained the count.
 */
status_t I2C_SlaveTransferGetCount(i2c_slave_transfer_handle_t *psHandle, uint16_t *count);

/*!
 * @brief Aborts the slave transfer.
 *
 * @note This API can be called at any time to stop slave for handling further bus events.
 *
 * @param base I2C base pointer.
 * @param psHandle pointer to i2c_slave_transfer_handle_t structure which stores the transfer state.
 */
void I2C_SlaveTransferAbort(i2c_slave_transfer_handle_t *psHandle);
/* @} */
/* ========================================= End of Transactional API Group ========================================= */

/*!
 * @brief Gets instance number for I2C module.
 *
 * @param base I2C base pointer.
 * @retval The number of the instance.
 */
uint32_t I2C_GetInstance(I2C_Type *base);

#if defined(__cplusplus)
}
#endif /*_cplusplus. */
/*@}*/

#endif /* _FSL_I2C_H_*/
